ECOEXPLORE_API/app/services/AuthService.rb

  def self.authenticate(email, password)
    user = User.find_by(email: email)
---
SELECT "users".* FROM "users" WHERE "users"."email" = 'juan@example.com' LIMIT 1