ECOEXPLORE_API/app/controllers/auth_controller.rb

INSERT INTO "users" ("email", "created_at", "updated_at", "points", "role", "password_digest", "name", "active") VALUES ('juan@example.com', '2025-08-11 20:50:43.248659', '2025-08-11 20:50:43.248659', NULL, 'user', '$2a$12$jadx6rOQYN9YlAyzFjndhe/oqMiaVWjJrlaXxLUyfe6HNwlM36cLi', 'Juan Perez', TRUE) RETURNING "id"
---
  def register
    user = User.new(user_params)
    user.role = 'member' unless user.role.present?

    if user.save