ECOEXPLORE_BACKEND/app/controllers/auth_controller.rb

  def register
    user = User.new(user_params)
    user.points = 0
    user.role = 'member' unless user.role.present?

    if user.save
---
INSERT INTO "users" ("email", "created_at", "updated_at", "points", "role", "password_digest", "name", "active") VALUES ('re@gmail.com', '2025-08-19 02:07:46.817321', '2025-08-19 02:07:46.817321', NULL, 'member', '$2a$12$Xb533/.mOUAHZc/K14bc.OTxZGfuDTeDH5vsW.WaYrpaBi2vf9AEy', 'Re', TRUE) RETURNING "id"