ECOEXPLORE_BACKEND/app/controllers/ecosystems_controller.rb

SELECT "ecosystems".* FROM "ecosystems" ORDER BY "ecosystems"."name" ASC
---
  def index
    ecosystems = Ecosystem.all.order(:name)
    render json: ecosystems.map { |ecosystem| ecosystem_response(ecosystem) }

SELECT "ecosystems".* FROM "ecosystems" WHERE "ecosystems"."id" = 6
---
  def set_ecosystem
    @ecosystem = Ecosystem.find(params[:id])