ECOEXPLORE_BACKEND/app/controllers/sightings_controller.rb

  def index
    sightings = Sighting.includes(:sighting_state, :location, :ecosystem, :user).all
    render json: sightings.map { |s| sighting_response(s) }, status: :ok
---
SELECT "ecosystems".* FROM "ecosystems" WHERE "ecosystems"."id" IN (6, 3)
SELECT "users".* FROM "users" WHERE "users"."id" IN ('095016ef-acb4-4753-b70f-6a970ed3aa1e', 'c681692a-07a1-4b1f-b50b-10a1634cbd83')
SELECT "locations".* FROM "locations" WHERE "locations"."id" IN (1, 2)
SELECT "sighting_states".* FROM "sighting_states" WHERE "sighting_states"."id" IN (1, 2)

  def create
    result = SightingService.create(user: current_user, params: creation_params)
---
INSERT INTO "sightings" ("user_id", "ecosystem_id", "location_id", "sighting_state_id", "description", "created_at", "updated_at") VALUES ('095016ef-acb4-4753-b70f-6a970ed3aa1e', 6, 1, 1, 'Nutria vista en la ribera', '2025-08-12 00:10:56.710336', '2025-08-12 00:10:56.710336') RETURNING "id"

  def update
    sighting_id = params[:id].presence || params[:sighting_id]
    result = SightingService.update_state(user: current_user, sighting_id: sighting_id, params: update_params)
---
UPDATE "sightings" SET "sighting_state_id" = 2, "updated_at" = '2025-08-12 03:57:52.661291' WHERE "sightings"."id" = '3da87414-b8be-42a9-8827-dee703f8e6d0'