ECOEXPLORE_BACKEND/app/services/AuthService.rb

  def self.authenticate(email, password)
    Rails.logger.info "🔍 AuthService.authenticate - Email: #{email}"
    user = User.find_by(email: email)
---
SELECT "users".* FROM "users" WHERE "users"."email" = 'diegoflo703@gmail.com' LIMIT 1

  def self.generate_token(user_id)
    user = User.find(user_id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = '095016ef-acb4-4753-b70f-6a970ed3aa1e' LIMIT 1