ECOEXPLORE_BACKEND/app/services/sighting_service.rb

SELECT "ecosystems".* FROM "ecosystems" WHERE "ecosystems"."id" = 6 LIMIT 1
INSERT INTO "sightings" ("user_id", "ecosystem_id", "location_id", "sighting_state_id", "description", "created_at", "updated_at") VALUES ('095016ef-acb4-4753-b70f-6a970ed3aa1e', 6, 1, 1, 'Nutria vista en la ribera', '2025-08-12 00:10:56.710336', '2025-08-12 00:10:56.710336') RETURNING "id"
---
  def self.create(user:, params:)
    ActiveRecord::Base.transaction do
      sighting_state = resolve_state(params)
      ecosystem = Ecosystem.find(params[:ecosystem_id])

      location = find_or_create_location(
        name: params[:location_name],
        coordinates: params[:coordinates]
      )

      sighting = user.sightings.new(
        ecosystem: ecosystem,
        location: location,
        sighting_state: sighting_state,
        description: params[:description]
      )

      if sighting.save

SELECT "sightings".* FROM "sightings" WHERE "sightings"."id" = NULL LIMIT 1
UPDATE "sightings" SET "sighting_state_id" = 2, "updated_at" = '2025-08-12 03:57:52.661291' WHERE "sightings"."id" = '3da87414-b8be-42a9-8827-dee703f8e6d0'
---
  def self.update_state(user:, sighting_id:, params:)
    return Result.new(success: false, error: 'Unauthorized') unless user&.role == 'admin'

    ActiveRecord::Base.transaction do
      sighting = Sighting.find(sighting_id)
      new_state = resolve_state(params)

      sighting.update!(sighting_state: new_state)

SELECT "sighting_states".* FROM "sighting_states" WHERE "sighting_states"."code" = 'ACCEPTED' LIMIT 1
SELECT "sighting_states".* FROM "sighting_states" WHERE "sighting_states"."code" = 'PENDING' LIMIT 1
---
  def self.resolve_state(params)
    if params[:sighting_state_id].present?
      SightingState.find(params[:sighting_state_id])
    elsif params[:sighting_state_code].present?
      SightingState.find_by!(code: params[:sighting_state_code].to_s.upcase)
    else
      # Asignar automáticamente el estado "pending" por defecto
      SightingState.find_by!(code: 'PENDING')

INSERT INTO "locations" ("name", "coordinates", "created_at", "updated_at") VALUES ('Lago', '5.5435,6.5406', '2025-08-19 04:10:42.024099', '2025-08-19 04:10:42.024099') RETURNING "id"
SELECT "locations".* FROM "locations" WHERE "locations"."name" = 'Lago' AND "locations"."coordinates" = '5.5435,6.5406' LIMIT 1
---
  def self.find_or_create_location(name:, coordinates:)
    raise ArgumentError, "location_name is required" if name.blank?

    # Las coordenadas son opcionales
    coords = coordinates.present? ? coordinates : nil
    Location.find_or_create_by!(name: name, coordinates: coords)